Write a Pandas program to create and display a DataFrame from the following dictionary data which has index labels.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Print the three first rows using head() method

In [6]:
 #Question1
 import pandas as pd
 import numpy as np
 exam_data = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
              'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
              'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}) 
 labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
 print(exam_data.head(3))

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

2/Delete rows with Nan values

In [8]:
#Question 2
print(exam_data.dropna())

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

3/Extract the 'name' and 'score' columns from the DataFrame.

In [12]:
#Question3
DF=exam_data[["name","score"]]
print(DF)

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

Write a Pandas program to append a new row 'k' to data frame with these values(name : "Suresh", score: 15.5, attempts: 1, qualify: "yes")

In [17]:
#Question4
df2=pd.DataFrame({"name":['Suresh'], "score": [15.5], "attempts" : [1], "qualify": ["yes"]})
print(exam_data.append(df2))

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
0     Suresh   15.5         1     yes

5/Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [20]:
#question5

print(exam_data.drop("attempts",axis=1))

        name  score qualify
0  Anastasia   12.5     yes
1       Dima    9.0      no
2  Katherine   16.5     yes
3      James    NaN      no
4      Emily    9.0      no
5    Michael   20.0     yes
6    Matthew   14.5     yes
7      Laura    NaN      no
8      Kevin    8.0      no
9      Jonas   19.0     yes

6/Add a new column "Success" : if the score is higher than 10 we will have 1 else we will have 0

In [25]:
#Question 6
exam_data.insert(3,"Success",[1,0,1,0,0,1,1,0,0,1],True)
exam_data

        name  score  attempts  Success  Success  success qualify  success
0  Anastasia   12.5         1        1        1        1     yes        1
1       Dima    9.0         3        0        0        0      no        0
2  Katherine   16.5         2        1        1        1     yes        1
3      James    NaN         3        0        0        0      no        0
4      Emily    9.0         2        0        0        0      no        0
5    Michael   20.0         3        1        1        1     yes        1
6    Matthew   14.5         1        1        1        1     yes        1
7      Laura    NaN         1        0        0        0      no        0
8      Kevin    8.0         2        0        0        0      no        0
9      Jonas   19.0         1        1        1        1     yes        1

7/After executing the final dataframe, export it into csv file named "my_data"

In [ ]:
#Question 7:

In [26]:
exam_data.to_csv("my data")
exam_data

        name  score  attempts  Success  Success  success qualify  success
0  Anastasia   12.5         1        1        1        1     yes        1
1       Dima    9.0         3        0        0        0      no        0
2  Katherine   16.5         2        1        1        1     yes        1
3      James    NaN         3        0        0        0      no        0
4      Emily    9.0         2        0        0        0      no        0
5    Michael   20.0         3        1        1        1     yes        1
6    Matthew   14.5         1        1        1        1     yes        1
7      Laura    NaN         1        0        0        0      no        0
8      Kevin    8.0         2        0        0        0      no        0
9      Jonas   19.0         1        1        1        1     yes        1